loadtest/results/phase2/step_guest_vu60.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed-guest-step.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 60 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 60/60 VUs, 186 complete and 0 interrupted iterations
default   [   1% ] 60 VUs  0m01.0s/2m0s

running (0m02.0s), 60/60 VUs, 392 complete and 0 interrupted iterations
default   [   2% ] 60 VUs  0m02.0s/2m0s

running (0m03.0s), 60/60 VUs, 591 complete and 0 interrupted iterations
default   [   2% ] 60 VUs  0m03.0s/2m0s

running (0m04.0s), 60/60 VUs, 781 complete and 0 interrupted iterations
default   [   3% ] 60 VUs  0m04.0s/2m0s

running (0m05.0s), 60/60 VUs, 956 complete and 0 interrupted iterations
default   [   4% ] 60 VUs  0m05.0s/2m0s

running (0m06.0s), 60/60 VUs, 1128 complete and 0 interrupted iterations
default   [   5% ] 60 VUs  0m06.0s/2m0s

running (0m07.0s), 60/60 VUs, 1282 complete and 0 interrupted iterations
default   [   6% ] 60 VUs  0m07.0s/2m0s

running (0m08.0s), 60/60 VUs, 1463 complete and 0 interrupted iterations
default   [   7% ] 60 VUs  0m08.0s/2m0s

running (0m09.0s), 60/60 VUs, 1672 complete and 0 interrupted iterations
default   [   7% ] 60 VUs  0m09.0s/2m0s

running (0m10.0s), 60/60 VUs, 1881 complete and 0 interrupted iterations
default   [   8% ] 60 VUs  0m10.0s/2m0s

running (0m11.0s), 60/60 VUs, 2084 complete and 0 interrupted iterations
default   [   9% ] 60 VUs  0m11.0s/2m0s

running (0m12.0s), 60/60 VUs, 2295 complete and 0 interrupted iterations
default   [  10% ] 60 VUs  0m12.0s/2m0s

running (0m13.0s), 60/60 VUs, 2506 complete and 0 interrupted iterations
default   [  11% ] 60 VUs  0m13.0s/2m0s

running (0m14.0s), 60/60 VUs, 2707 complete and 0 interrupted iterations
default   [  12% ] 60 VUs  0m14.0s/2m0s

running (0m15.0s), 60/60 VUs, 2918 complete and 0 interrupted iterations
default   [  12% ] 60 VUs  0m15.0s/2m0s

running (0m16.0s), 60/60 VUs, 3106 complete and 0 interrupted iterations
default   [  13% ] 60 VUs  0m16.0s/2m0s

running (0m17.0s), 60/60 VUs, 3272 complete and 0 interrupted iterations
default   [  14% ] 60 VUs  0m17.0s/2m0s

running (0m18.0s), 60/60 VUs, 3434 complete and 0 interrupted iterations
default   [  15% ] 60 VUs  0m18.0s/2m0s

running (0m19.0s), 60/60 VUs, 3599 complete and 0 interrupted iterations
default   [  16% ] 60 VUs  0m19.0s/2m0s

running (0m20.0s), 60/60 VUs, 3810 complete and 0 interrupted iterations
default   [  17% ] 60 VUs  0m20.0s/2m0s

running (0m21.0s), 60/60 VUs, 4021 complete and 0 interrupted iterations
default   [  17% ] 60 VUs  0m21.0s/2m0s

running (0m22.0s), 60/60 VUs, 4221 complete and 0 interrupted iterations
default   [  18% ] 60 VUs  0m22.0s/2m0s

running (0m23.0s), 60/60 VUs, 4432 complete and 0 interrupted iterations
default   [  19% ] 60 VUs  0m23.0s/2m0s

running (0m24.0s), 60/60 VUs, 4644 complete and 0 interrupted iterations
default   [  20% ] 60 VUs  0m24.0s/2m0s

running (0m25.0s), 60/60 VUs, 4856 complete and 0 interrupted iterations
default   [  21% ] 60 VUs  0m25.0s/2m0s

running (0m26.0s), 60/60 VUs, 5059 complete and 0 interrupted iterations
default   [  22% ] 60 VUs  0m26.0s/2m0s

running (0m27.0s), 60/60 VUs, 5261 complete and 0 interrupted iterations
default   [  22% ] 60 VUs  0m27.0s/2m0s

running (0m28.0s), 60/60 VUs, 5442 complete and 0 interrupted iterations
default   [  23% ] 60 VUs  0m28.0s/2m0s

running (0m29.0s), 60/60 VUs, 5608 complete and 0 interrupted iterations
default   [  24% ] 60 VUs  0m29.0s/2m0s

running (0m30.0s), 60/60 VUs, 5778 complete and 0 interrupted iterations
default   [  25% ] 60 VUs  0m30.0s/2m0s

running (0m31.0s), 60/60 VUs, 5955 complete and 0 interrupted iterations
default   [  26% ] 60 VUs  0m31.0s/2m0s

running (0m32.0s), 60/60 VUs, 6158 complete and 0 interrupted iterations
default   [  27% ] 60 VUs  0m32.0s/2m0s

running (0m33.0s), 60/60 VUs, 6369 complete and 0 interrupted iterations
default   [  27% ] 60 VUs  0m33.0s/2m0s

running (0m34.0s), 60/60 VUs, 6579 complete and 0 interrupted iterations
default   [  28% ] 60 VUs  0m34.0s/2m0s

running (0m35.0s), 60/60 VUs, 6788 complete and 0 interrupted iterations
default   [  29% ] 60 VUs  0m35.0s/2m0s

running (0m36.0s), 60/60 VUs, 7000 complete and 0 interrupted iterations
default   [  30% ] 60 VUs  0m36.0s/2m0s

running (0m37.0s), 60/60 VUs, 7193 complete and 0 interrupted iterations
default   [  31% ] 60 VUs  0m37.0s/2m0s

running (0m38.0s), 60/60 VUs, 7401 complete and 0 interrupted iterations
default   [  32% ] 60 VUs  0m38.0s/2m0s

running (0m39.0s), 60/60 VUs, 7604 complete and 0 interrupted iterations
default   [  32% ] 60 VUs  0m39.0s/2m0s

running (0m40.0s), 60/60 VUs, 7780 complete and 0 interrupted iterations
default   [  33% ] 60 VUs  0m40.0s/2m0s

running (0m41.0s), 60/60 VUs, 7953 complete and 0 interrupted iterations
default   [  34% ] 60 VUs  0m41.0s/2m0s

running (0m42.0s), 60/60 VUs, 8102 complete and 0 interrupted iterations
default   [  35% ] 60 VUs  0m42.0s/2m0s

running (0m43.0s), 60/60 VUs, 8282 complete and 0 interrupted iterations
default   [  36% ] 60 VUs  0m43.0s/2m0s

running (0m44.0s), 60/60 VUs, 8488 complete and 0 interrupted iterations
default   [  37% ] 60 VUs  0m44.0s/2m0s

running (0m45.0s), 60/60 VUs, 8695 complete and 0 interrupted iterations
default   [  37% ] 60 VUs  0m45.0s/2m0s

running (0m46.0s), 60/60 VUs, 8903 complete and 0 interrupted iterations
default   [  38% ] 60 VUs  0m46.0s/2m0s

running (0m47.0s), 60/60 VUs, 9108 complete and 0 interrupted iterations
default   [  39% ] 60 VUs  0m47.0s/2m0s

running (0m48.0s), 60/60 VUs, 9312 complete and 0 interrupted iterations
default   [  40% ] 60 VUs  0m48.0s/2m0s

running (0m49.0s), 60/60 VUs, 9511 complete and 0 interrupted iterations
default   [  41% ] 60 VUs  0m49.0s/2m0s

running (0m50.0s), 60/60 VUs, 9722 complete and 0 interrupted iterations
default   [  42% ] 60 VUs  0m50.0s/2m0s

running (0m51.0s), 60/60 VUs, 9913 complete and 0 interrupted iterations
default   [  42% ] 60 VUs  0m51.0s/2m0s

running (0m52.0s), 60/60 VUs, 10088 complete and 0 interrupted iterations
default   [  43% ] 60 VUs  0m52.0s/2m0s

running (0m53.0s), 60/60 VUs, 10233 complete and 0 interrupted iterations
default   [  44% ] 60 VUs  0m53.0s/2m0s

running (0m54.0s), 60/60 VUs, 10407 complete and 0 interrupted iterations
default   [  45% ] 60 VUs  0m54.0s/2m0s

running (0m55.0s), 60/60 VUs, 10616 complete and 0 interrupted iterations
default   [  46% ] 60 VUs  0m55.0s/2m0s

running (0m56.0s), 60/60 VUs, 10823 complete and 0 interrupted iterations
default   [  47% ] 60 VUs  0m56.0s/2m0s

running (0m57.0s), 60/60 VUs, 11034 complete and 0 interrupted iterations
default   [  47% ] 60 VUs  0m57.0s/2m0s

running (0m58.0s), 60/60 VUs, 11241 complete and 0 interrupted iterations
default   [  48% ] 60 VUs  0m58.0s/2m0s

running (0m59.0s), 60/60 VUs, 11447 complete and 0 interrupted iterations
default   [  49% ] 60 VUs  0m59.0s/2m0s

running (1m00.0s), 60/60 VUs, 11640 complete and 0 interrupted iterations
default   [  50% ] 60 VUs  1m00.0s/2m0s

running (1m01.0s), 60/60 VUs, 11848 complete and 0 interrupted iterations
default   [  51% ] 60 VUs  1m01.0s/2m0s

running (1m02.0s), 60/60 VUs, 12055 complete and 0 interrupted iterations
default   [  52% ] 60 VUs  1m02.0s/2m0s

running (1m03.0s), 60/60 VUs, 12232 complete and 0 interrupted iterations
default   [  52% ] 60 VUs  1m03.0s/2m0s

running (1m04.0s), 60/60 VUs, 12395 complete and 0 interrupted iterations
default   [  53% ] 60 VUs  1m04.0s/2m0s

running (1m05.0s), 60/60 VUs, 12540 complete and 0 interrupted iterations
default   [  54% ] 60 VUs  1m05.0s/2m0s

running (1m06.0s), 60/60 VUs, 12739 complete and 0 interrupted iterations
default   [  55% ] 60 VUs  1m06.0s/2m0s

running (1m07.0s), 60/60 VUs, 12946 complete and 0 interrupted iterations
default   [  56% ] 60 VUs  1m07.0s/2m0s

running (1m08.0s), 60/60 VUs, 13156 complete and 0 interrupted iterations
default   [  57% ] 60 VUs  1m08.0s/2m0s

running (1m09.0s), 60/60 VUs, 13360 complete and 0 interrupted iterations
default   [  57% ] 60 VUs  1m09.0s/2m0s

running (1m10.0s), 60/60 VUs, 13568 complete and 0 interrupted iterations
default   [  58% ] 60 VUs  1m10.0s/2m0s

running (1m11.0s), 60/60 VUs, 13771 complete and 0 interrupted iterations
default   [  59% ] 60 VUs  1m11.0s/2m0s

running (1m12.0s), 60/60 VUs, 13970 complete and 0 interrupted iterations
default   [  60% ] 60 VUs  1m12.0s/2m0s

running (1m13.0s), 60/60 VUs, 14175 complete and 0 interrupted iterations
default   [  61% ] 60 VUs  1m13.0s/2m0s

running (1m14.0s), 60/60 VUs, 14356 complete and 0 interrupted iterations
default   [  62% ] 60 VUs  1m14.0s/2m0s

running (1m15.0s), 60/60 VUs, 14523 complete and 0 interrupted iterations
default   [  62% ] 60 VUs  1m15.0s/2m0s

running (1m16.0s), 60/60 VUs, 14686 complete and 0 interrupted iterations
default   [  63% ] 60 VUs  1m16.0s/2m0s

running (1m17.0s), 60/60 VUs, 14840 complete and 0 interrupted iterations
default   [  64% ] 60 VUs  1m17.0s/2m0s

running (1m18.0s), 60/60 VUs, 15045 complete and 0 interrupted iterations
default   [  65% ] 60 VUs  1m18.0s/2m0s

running (1m19.0s), 60/60 VUs, 15252 complete and 0 interrupted iterations
default   [  66% ] 60 VUs  1m19.0s/2m0s

running (1m20.0s), 60/60 VUs, 15454 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  1m20.0s/2m0s

running (1m21.0s), 60/60 VUs, 15656 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  1m21.0s/2m0s

running (1m22.0s), 60/60 VUs, 15864 complete and 0 interrupted iterations
default   [  68% ] 60 VUs  1m22.0s/2m0s

running (1m23.0s), 60/60 VUs, 16070 complete and 0 interrupted iterations
default   [  69% ] 60 VUs  1m23.0s/2m0s

running (1m24.0s), 60/60 VUs, 16268 complete and 0 interrupted iterations
default   [  70% ] 60 VUs  1m24.0s/2m0s

running (1m25.0s), 60/60 VUs, 16465 complete and 0 interrupted iterations
default   [  71% ] 60 VUs  1m25.0s/2m0s

running (1m26.0s), 60/60 VUs, 16643 complete and 0 interrupted iterations
default   [  72% ] 60 VUs  1m26.0s/2m0s

running (1m27.0s), 60/60 VUs, 16809 complete and 0 interrupted iterations
default   [  72% ] 60 VUs  1m27.0s/2m0s

running (1m28.0s), 60/60 VUs, 16971 complete and 0 interrupted iterations
default   [  73% ] 60 VUs  1m28.0s/2m0s

running (1m29.0s), 60/60 VUs, 17141 complete and 0 interrupted iterations
default   [  74% ] 60 VUs  1m29.0s/2m0s

running (1m30.0s), 60/60 VUs, 17340 complete and 0 interrupted iterations
default   [  75% ] 60 VUs  1m30.0s/2m0s

running (1m31.0s), 60/60 VUs, 17550 complete and 0 interrupted iterations
default   [  76% ] 60 VUs  1m31.0s/2m0s

running (1m32.0s), 60/60 VUs, 17759 complete and 0 interrupted iterations
default   [  77% ] 60 VUs  1m32.0s/2m0s

running (1m33.0s), 60/60 VUs, 17961 complete and 0 interrupted iterations
default   [  77% ] 60 VUs  1m33.0s/2m0s

running (1m34.0s), 60/60 VUs, 18165 complete and 0 interrupted iterations
default   [  78% ] 60 VUs  1m34.0s/2m0s

running (1m35.0s), 60/60 VUs, 18355 complete and 0 interrupted iterations
default   [  79% ] 60 VUs  1m35.0s/2m0s

running (1m36.0s), 60/60 VUs, 18561 complete and 0 interrupted iterations
default   [  80% ] 60 VUs  1m36.0s/2m0s

running (1m37.0s), 60/60 VUs, 18769 complete and 0 interrupted iterations
default   [  81% ] 60 VUs  1m37.0s/2m0s

running (1m38.0s), 60/60 VUs, 18939 complete and 0 interrupted iterations
default   [  82% ] 60 VUs  1m38.0s/2m0s

running (1m39.0s), 60/60 VUs, 19117 complete and 0 interrupted iterations
default   [  82% ] 60 VUs  1m39.0s/2m0s

running (1m40.0s), 60/60 VUs, 19264 complete and 0 interrupted iterations
default   [  83% ] 60 VUs  1m40.0s/2m0s

running (1m41.0s), 60/60 VUs, 19434 complete and 0 interrupted iterations
default   [  84% ] 60 VUs  1m41.0s/2m0s

running (1m42.0s), 60/60 VUs, 19642 complete and 0 interrupted iterations
default   [  85% ] 60 VUs  1m42.0s/2m0s

running (1m43.0s), 60/60 VUs, 19851 complete and 0 interrupted iterations
default   [  86% ] 60 VUs  1m43.0s/2m0s

running (1m44.0s), 60/60 VUs, 20056 complete and 0 interrupted iterations
default   [  87% ] 60 VUs  1m44.0s/2m0s

running (1m45.0s), 60/60 VUs, 20262 complete and 0 interrupted iterations
default   [  87% ] 60 VUs  1m45.0s/2m0s

running (1m46.0s), 60/60 VUs, 20457 complete and 0 interrupted iterations
default   [  88% ] 60 VUs  1m46.0s/2m0s

running (1m47.0s), 60/60 VUs, 20659 complete and 0 interrupted iterations
default   [  89% ] 60 VUs  1m47.0s/2m0s

running (1m48.0s), 60/60 VUs, 20853 complete and 0 interrupted iterations
default   [  90% ] 60 VUs  1m48.0s/2m0s

running (1m49.0s), 60/60 VUs, 21057 complete and 0 interrupted iterations
default   [  91% ] 60 VUs  1m49.0s/2m0s

running (1m50.0s), 60/60 VUs, 21232 complete and 0 interrupted iterations
default   [  92% ] 60 VUs  1m50.0s/2m0s

running (1m51.0s), 60/60 VUs, 21393 complete and 0 interrupted iterations
default   [  92% ] 60 VUs  1m51.0s/2m0s

running (1m52.0s), 60/60 VUs, 21546 complete and 0 interrupted iterations
default   [  93% ] 60 VUs  1m52.0s/2m0s

running (1m53.0s), 60/60 VUs, 21717 complete and 0 interrupted iterations
default   [  94% ] 60 VUs  1m53.0s/2m0s

running (1m54.0s), 60/60 VUs, 21919 complete and 0 interrupted iterations
default   [  95% ] 60 VUs  1m54.0s/2m0s

running (1m55.0s), 60/60 VUs, 22122 complete and 0 interrupted iterations
default   [  96% ] 60 VUs  1m55.0s/2m0s

running (1m56.0s), 60/60 VUs, 22318 complete and 0 interrupted iterations
default   [  97% ] 60 VUs  1m56.0s/2m0s

running (1m57.0s), 60/60 VUs, 22518 complete and 0 interrupted iterations
default   [  97% ] 60 VUs  1m57.0s/2m0s

running (1m58.0s), 60/60 VUs, 22723 complete and 0 interrupted iterations
default   [  98% ] 60 VUs  1m58.0s/2m0s

running (1m59.0s), 60/60 VUs, 22909 complete and 0 interrupted iterations
default   [  99% ] 60 VUs  1m59.0s/2m0s

running (2m00.0s), 60/60 VUs, 23106 complete and 0 interrupted iterations
default   [ 100% ] 60 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 46348   385.384756/s
    checks_succeeded...: 100.00% 46348 out of 46348
    checks_failed......: 0.00%   0 out of 46348

    ✓ status 200
    ✓ 본문 있음

    CUSTOM
    feed_guest_duration............: avg=310.71ms min=19.77ms med=297.34ms p(90)=395.27ms p(95)=510.56ms p(99)=648.62ms max=1.09s

    HTTP
    http_req_duration..............: avg=310.71ms min=19.77ms med=297.34ms p(90)=395.27ms p(95)=510.56ms p(99)=648.62ms max=1.09s
      { expected_response:true }...: avg=310.71ms min=19.77ms med=297.34ms p(90)=395.27ms p(95)=510.56ms p(99)=648.62ms max=1.09s
    http_req_failed................: 0.00%  0 out of 23174
    http_reqs......................: 23174  192.692378/s

    EXECUTION
    iteration_duration.............: avg=311.02ms min=20.03ms med=297.66ms p(90)=395.54ms p(95)=510.85ms p(99)=648.94ms max=1.09s
    iterations.....................: 23174  192.692378/s
    vus............................: 60     min=60         max=60
    vus_max........................: 60     min=60         max=60

    NETWORK
    data_received..................: 327 MB 2.7 MB/s
    data_sent......................: 1.9 MB 16 kB/s



running (2m00.3s), 00/60 VUs, 23174 complete and 0 interrupted iterations
default ✓ [ 100% ] 60 VUs  2m0s